In [48]:
import pandas as pd
import numpy as np

In [49]:
base = pd.read_csv('credit_data.csv')

In [50]:
base.describe()

        i#clientid        income          age          loan    c#default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [51]:
base.age.describe()

count    1997.000000
mean       40.807559
std        13.624469
min       -52.423280
25%        28.990415
50%        41.317159
75%        52.587040
max        63.971796
Name: age, dtype: float64

In [52]:
base.loc[base['age'] < 0]

    i#clientid        income        age         loan  c#default
15          16  50501.726689 -28.218361  3977.287432          0
21          22  32197.620701 -52.423280  4244.057136          0
26          27  63287.038908 -36.496976  9595.286289          0

In [53]:
#Alternativa de deletar coluna
base.drop('age', 1, inplace=True)
base.head()

   i#clientid        income         loan  c#default
0           1  66155.925095  8106.532131          0
1           2  34415.153966  6564.745018          0
2           3  57317.170063  8020.953296          0
3           4  42709.534201  6103.642260          0
4           5  66952.688845  8770.099235          1

In [54]:
#Deletar registros invalidos
base = pd.read_csv('credit_data.csv')
base.drop(base[base.age < 0].index, inplace=True)
base.describe()

        i#clientid        income          age          loan    c#default
count  1997.000000   1997.000000  1994.000000   1997.000000  1997.000000
mean   1001.970456  45326.596720    40.927700   4442.124566     0.141713
std     576.679293  14327.971550    13.271802   3045.494192     0.348842
min       1.000000  20014.489470    18.055189      1.377630     0.000000
25%     503.000000  32804.904487    29.043284   1936.813257     0.000000
50%    1002.000000  45788.747100    41.382673   3971.155479     0.000000
75%    1501.000000  57787.565659    52.616900   6429.593688     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [55]:
#substituir valor pela media
base.loc[base['age'] < 0, 'age'] = base.age.mean()

In [56]:
pd.isnull(base.age)

0       False
1       False
2       False
3       False
4       False
        ...
1995    False
1996    False
1997    False
1998    False
1999    False
Name: age, Length: 1997, dtype: bool

In [57]:
base.loc[pd.isnull(base.age)]

    i#clientid        income  age         loan  c#default
28          29  59417.805406  NaN  2082.625938          0
30          31  48528.852796  NaN  6155.784670          0
31          32  23526.302555  NaN  2862.010139          0

In [58]:
previsores = base.iloc[:,1:4].values

In [59]:
classe = base.iloc[:, 4].values

In [60]:
from sklearn.impute import SimpleImputer

In [61]:
imputer = SimpleImputer(
    missing_values=np.nan,
    strategy='mean',
    fill_value=None,
    verbose=0,
    copy=True,
    add_indicator=False,
)
imputer = imputer.fit(previsores[:, 0:3])
previsores[:, 0:3] = imputer.transform(previsores[:,0:3])

In [62]:
# padrozinazação dos dados, importante para que o algoritimo não entendar variaveis como maiores valores, 
# como mais importante, principamente para modelos que utilizam de distancia euclidiana
# pode ajudar no
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
provisores = scaler.fit_transform(previsores)
provisores

array([[ 1.45411689,  1.36435564,  1.20352401],
       [-0.76173907,  0.54225218,  0.69714535],
       [ 0.83707429,  1.67291491,  1.17541683],
       ...,
       [-0.07086849, -0.97375493,  0.35492854],
       [-0.10964103,  1.73806151, -0.9259936 ],
       [ 1.68314276,  1.14831331,  0.96452149]])

array([[ 1.45411689,  1.36435564,  1.20352401],
       [-0.76173907,  0.54225218,  0.69714535],
       [ 0.83707429,  1.67291491,  1.17541683],
       ...,
       [-0.07086849, -0.97375493,  0.35492854],
       [-0.10964103,  1.73806151, -0.9259936 ],
       [ 1.68314276,  1.14831331,  0.96452149]])